Autodesk.Revit.DB.Structure.RebarSpliceRules.SetMaximumAndMinimumBarLength(System.Double,System.Double)
Sets the maximum and minimum bar length.
maximumBarLength:
The maximum bar length.
minimumBarLength:
The minimum bar length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The maximum bar length should be greater or almost equal to the minimum bar length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for minimumBarLength must be between 0 and 30000 feet.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceRules.Create(Autodesk.Revit.DB.Document)
Creates a new instance of RebarSpliceRules with the default options.
document:
A document. The units in this document will be used to initialize default values.
Returns:
Returns an instance of RebarSpliceRules with the default options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceRules.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarSpliceRules.RunOutPosition
Identifies the run-out position.
The default value is RebarSpliceByRulesRunOutPosition.End.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceRules.MinimumBarLength
Identifies the minimum bar length.
The default value is 1 meter if the document units are in Metric System, or 3 feet if the units are in Imperial System.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The minimum bar length should be less or almost equal to the maximum bar length.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for minimumBarLength must be between 0 and 30000 feet.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceRules.MaximumBarLength
Identifies the maximum bar length.
The default value is 12 meters if the document units are in Metric System, or 40 feet if the units are in Imperial System.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The maximum bar length should be greater or almost equal to the minimum bar length.
Since:
2025

Autodesk.Revit.DB.Structure.RebarSpliceRules
Describes the rules for splicing Rebar.
Since:
2025